def hastag_msg(username:
    msg = "안녕하세요, 동물권단체 '동물해방물결'이라고 합니다. 동물도 고통으로부터 자유로울 권리를 인정받는 사회를 확립하기 위해 11월 15일 창립한 동물해방물결은, 구조 및 입양에 주력하는 기존 동물단체들과는 차별화된 대중 캠페인을 전개해나갈 예정이며, 그 일환으로 개식용에 관한 첫 인스타그램 캠페인을 진행하고자 합니다. 동물권 보호 내용의 해시태그를 통해 @{}님의 포스팅을 발견하였고, 이에 캠페인 참여를 요청드리고 싶습니다.
    
    '대한민국 식용개를 해방하라' 캠페인은 비디오 형태로, 그 취지를 설명하고, 추가적으로 2명을 지목하여 바이럴하게 퍼지는 것을 목표로 하고 있습니다. @{}님의 포스팅을 통해 보다 많은 사람들이 개 뿐만 아니라 모든 동물의 고통으로부터 자유로울 권리에 공감했으면 합니다. 최근 '소방관Go챌린지'와 같은 느낌이라고 보셔도 좋습니다! (예시: [http://bit.ly/2A7ht3y](http://bit.ly/2A7ht3y) )
    
    이 캠페인은 약 50만명의 인스타그램 사용자에게 노출하고, 25만개 이상의 좋아요를 받는 것이 목표입니다! 이를 바탕으로 1월에는 동물권 및 개식용 종식에 대한 이해 및 지지를 확산하는 큰 전시회를 열 것이며, 이에 최대 1500만원의 예산을 집행하고자 합니다. @{}님의 참여가 큰 도움이 될 것 같아 연락을 드렸습니다. 
    
    동물해방물결에 대한 궁금한 점이 있으시다면 DM을 통해 질문해주셔도 되며 웹사이트 방문 (http://bit.ly/2zCL3yt) 해주셔도 좋습니다. 답장 기다리겠습니다!".format(username, username, username)
    return msg

def graph_msg(username):
    msg = "안녕하세요, 동물권단체 '동물해방물결'이라고 합니다. 동물도 고통으로부터 자유로울 권리를 인정받는 사회를 확립하기 위해 11월 15일 창립한 동물해방물결은, 구조 및 입양에 주력하는 기존 동물단체들과는 차별화된 대중 캠페인을 전개해나갈 예정이며, 그 일환으로 개식용에 관한 첫 인스타그램 캠페인을 진행하고자 합니다. 동물권, 특히 개에 대한 좋은 포스팅을 공유하신 @{}님의 포스팅을 발견했고, 이에 캠페인 참여를 요청드리고 싶습니다.
    
    '대한민국 식용개를 해방하라' 캠페인은 비디오 형태로, 그 취지를 설명하고, 추가적으로 2명을 지목하여 바이럴하게 퍼지는 것을 목표로 하고 있습니다. @{}님의 포스팅을 통해 보다 많은 사람들이 개 뿐만 아니라 모든 동물의 고통으로부터 자유로울 권리에 공감했으면 합니다. 최근 '소방관Go챌린지'와 같은 느낌이라고 보셔도 좋습니다! (예시: [http://bit.ly/2A7ht3y](http://bit.ly/2A7ht3y) )
    
    @이 캠페인은 약 50만명의 인스타그램 사용자에게 노출하고, 25만개 이상의 좋아요를 받는 것이 목표입니다! 이를 바탕으로 1월에는 동물권 및 개식용 종식에 대한 이해 및 지지를 확산하는 큰 전시회를 열 것이며, 이에 최대 1500만원의 예산을 집행하고자 합니다. @{}님의 참여가 개고기 식용 반대에 큰 도움이 될 것 같아 연락드렸습니다. 
    
    동물해방물결에 대한 궁금한 점이 있으시다면 DM을 통해 질문해주셔도 되며 웹사이트 방문 (http://bit.ly/2zCL3yt) 해주셔도 좋습니다. 답장 기다리겠습니다!".format(username, username, username)
